Tekla Open API Reference for Tekla Structures 2025
UnitAttributes Constructor
Overload List
Name | Description
UnitAttributes()
 Creates a new default UnitAttributes attributes instance. The default values are Units.Automatic, FormatTypes.Automatic.
UnitAttributes(Units, FormatTypes)
 Creates a new UnitAttributes attributes instance with the given parameters.
Top
See Also
Reference
UnitAttributes Class
Tekla.Structures.Drawing Namespace